app/controllers/contacts_controller.rb

SELECT "logs".* FROM "logs" WHERE "logs"."cookie" = $1  [["cookie", "1234"]]
---
  def show
    @logs = Log.where(cookie: @contact.cookie)

INSERT INTO "contacts" ("cookie", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cookie", "1234"], ["email", "abc@email.com"], ["created_at", "2017-02-12 20:46:29.360433"], ["updated_at", "2017-02-12 20:46:29.360433"]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save